# запрашиваем у пользователя число от 1 до 999
while True:
    number = input("Введите число от 1 до 999: ")
    if number.isdigit() and 1 <= int(number) <= 999:
        break

num = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
units = ["", "один", "два", "три", "четыре", "пять", "шесть",
         "семь", "восемь", "девять"]
teens = ["", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
         "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят",
        "семьдесят", "восемьдесят", "девяносто"]
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот",
            "семьсот", "восемьсот", "девятьсот"]

# соединяем списки в словари: для единиц, десятков, сотен и чисел 11-19
units_dict = dict(zip(num, units))
teens_dict = dict(zip(num, teens))
tens_dict = dict(zip(num, tens))
hundred_dict = dict(zip(num, hundreds))

result = ""
# если число состоит из одной цифры, выводим её словами
if len(number) == 1:
    result = units_dict[number]
# если число длины 3, возвращаем словами первую цифру
elif len(number) == 3:
    result += hundred_dict[number[0]] + " "
# условие для десятков:
if len(number) > 1:
    # отдельно рассматриваем случай, если две последние цифры от 11 до 19
    if number[-2] == "1" and number[-1] != "0":
        result += teens_dict[number[-1]]
    else:
        result += tens_dict[number[-2]] + " "
        result += units_dict[number[-1]]

print(result.strip())
